{"format": "graph-model", "generatedBy": "2.15.0", "convertedBy": "TensorFlow.js Converter v4.22.0", "signature": {"inputs": {"lstm_input": {"name": "lstm_input:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "512"}, {"size": "1"}]}}}, "outputs": {"output_0": {"name": "Identity:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "20"}]}}}}, "modelTopology": {"node": [{"name": "StatefulPartitionedCall/sequential/lstm_1/PartitionedCall/TensorArrayV2_1/element_shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/lstm_1/PartitionedCall/TensorArrayV2_1/num_elements", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/lstm_1/zeros_1/packed/1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/lstm_1/zeros_1/Const", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/lstm_1/PartitionedCall/TensorArrayUnstack/TensorListFromTensor/element_shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/lstm_1/Read/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}, {"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/transpose_1/perm", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/lstm_1/strided_slice/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/lstm_1/strided_slice/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/lstm_1/strided_slice/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/lstm_1/zeros/packed/1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/lstm_1/zeros/Const", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/lstm_1/Read_1/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}, {"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/lstm_1/Read_2/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/lstm_1/PartitionedCall/time", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/TensorArrayV2_1/element_shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/zeros_1/packed/1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/zeros_1/Const", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/TensorArrayUnstack/TensorListFromTensor/element_shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/Read/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/strided_slice/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/strided_slice/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/strided_slice/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/zeros/packed/1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/zeros/Const", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/Read_1/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}, {"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/Read_2/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/time", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/transpose/perm", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/strided_slice/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/strided_slice/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/strided_slice/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/loop_counter", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/TensorArrayV2Stack/TensorListStack/element_shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/lstm_1/PartitionedCall/strided_slice/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/lstm_1/PartitionedCall/strided_slice/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/lstm_1/PartitionedCall/strided_slice/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/lstm_1/PartitionedCall/while/loop_counter", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/lstm_1/PartitionedCall/TensorArrayV2Stack/TensorListStack/element_shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/lstm_1/PartitionedCall/strided_slice_2/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/lstm_1/PartitionedCall/strided_slice_2/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/lstm_1/PartitionedCall/strided_slice_2/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/dense/MatMul/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/dense/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/dense_1/MatMul/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}, {"size": "20"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/dense_1/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "20"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "lstm_input", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}, {"size": "512"}, {"size": "1"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/lstm_1/PartitionedCall/TensorArrayV2_1", "op": "TensorListReserve", "input": ["StatefulPartitionedCall/sequential/lstm_1/PartitionedCall/TensorArrayV2_1/element_shape", "StatefulPartitionedCall/sequential/lstm_1/PartitionedCall/TensorArrayV2_1/num_elements"], "attr": {"shape_type": {"type": "DT_INT32"}, "element_dtype": {"type": "DT_FLOAT"}}, "experimentalType": {"typeId": "TFT_PRODUCT", "args": [{"typeId": "TFT_ARRAY", "args": [{"typeId": "TFT_TENSOR", "args": [{"typeId": "TFT_FLOAT"}]}]}]}}, {"name": "StatefulPartitionedCall/sequential/lstm_1/PartitionedCall/while/enter/_105", "op": "Enter", "input": ["StatefulPartitionedCall/sequential/lstm_1/Read/ReadVariableOp"], "attr": {"is_constant": {"b": false}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvc2VxdWVudGlhbC9sc3RtXzEvUGFydGl0aW9uZWRDYWxsL3doaWxl"}, "T": {"type": "DT_FLOAT"}, "parallel_iterations": {"i": "32"}}}, {"name": "StatefulPartitionedCall/sequential/lstm_1/PartitionedCall/while/enter/_106", "op": "Enter", "input": ["StatefulPartitionedCall/sequential/lstm_1/Read_1/ReadVariableOp"], "attr": {"is_constant": {"b": false}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvc2VxdWVudGlhbC9sc3RtXzEvUGFydGl0aW9uZWRDYWxsL3doaWxl"}, "T": {"type": "DT_FLOAT"}, "parallel_iterations": {"i": "32"}}}, {"name": "StatefulPartitionedCall/sequential/lstm_1/PartitionedCall/while/enter/_107", "op": "Enter", "input": ["StatefulPartitionedCall/sequential/lstm_1/Read_2/ReadVariableOp"], "attr": {"is_constant": {"b": false}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvc2VxdWVudGlhbC9sc3RtXzEvUGFydGl0aW9uZWRDYWxsL3doaWxl"}, "T": {"type": "DT_FLOAT"}, "parallel_iterations": {"i": "32"}}}, {"name": "StatefulPartitionedCall/sequential/lstm_1/PartitionedCall/while/enter/_99", "op": "Enter", "input": ["StatefulPartitionedCall/sequential/lstm_1/PartitionedCall/time"], "attr": {"is_constant": {"b": false}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvc2VxdWVudGlhbC9sc3RtXzEvUGFydGl0aW9uZWRDYWxsL3doaWxl"}, "T": {"type": "DT_INT32"}, "parallel_iterations": {"i": "32"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/enter/_45", "op": "Enter", "input": ["StatefulPartitionedCall/sequential/lstm/Read/ReadVariableOp"], "attr": {"is_constant": {"b": false}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvc2VxdWVudGlhbC9sc3RtL1BhcnRpdGlvbmVkQ2FsbC93aGlsZQ=="}, "T": {"type": "DT_FLOAT"}, "parallel_iterations": {"i": "32"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/enter/_46", "op": "Enter", "input": ["StatefulPartitionedCall/sequential/lstm/Read_1/ReadVariableOp"], "attr": {"is_constant": {"b": false}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvc2VxdWVudGlhbC9sc3RtL1BhcnRpdGlvbmVkQ2FsbC93aGlsZQ=="}, "T": {"type": "DT_FLOAT"}, "parallel_iterations": {"i": "32"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/enter/_47", "op": "Enter", "input": ["StatefulPartitionedCall/sequential/lstm/Read_2/ReadVariableOp"], "attr": {"is_constant": {"b": false}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvc2VxdWVudGlhbC9sc3RtL1BhcnRpdGlvbmVkQ2FsbC93aGlsZQ=="}, "T": {"type": "DT_FLOAT"}, "parallel_iterations": {"i": "32"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/enter/_39", "op": "Enter", "input": ["StatefulPartitionedCall/sequential/lstm/PartitionedCall/time"], "attr": {"is_constant": {"b": false}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvc2VxdWVudGlhbC9sc3RtL1BhcnRpdGlvbmVkQ2FsbC93aGlsZQ=="}, "T": {"type": "DT_INT32"}, "parallel_iterations": {"i": "32"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/enter/_37", "op": "Enter", "input": ["StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/loop_counter"], "attr": {"is_constant": {"b": false}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvc2VxdWVudGlhbC9sc3RtL1BhcnRpdGlvbmVkQ2FsbC93aGlsZQ=="}, "T": {"type": "DT_INT32"}, "parallel_iterations": {"i": "32"}}}, {"name": "StatefulPartitionedCall/sequential/lstm_1/PartitionedCall/while/enter/_97", "op": "Enter", "input": ["StatefulPartitionedCall/sequential/lstm_1/PartitionedCall/while/loop_counter"], "attr": {"is_constant": {"b": false}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvc2VxdWVudGlhbC9sc3RtXzEvUGFydGl0aW9uZWRDYWxsL3doaWxl"}, "T": {"type": "DT_INT32"}, "parallel_iterations": {"i": "32"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/Shape", "op": "Shape", "input": ["lstm_input"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}, "experimentalType": {"typeId": "TFT_PRODUCT", "args": [{"typeId": "TFT_SHAPE_TENSOR", "args": [{"typeId": "TFT_INT32"}]}]}}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/transpose", "op": "Transpose", "input": ["lstm_input", "StatefulPartitionedCall/sequential/lstm/PartitionedCall/transpose/perm"], "attr": {"Tperm": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/lstm_1/PartitionedCall/while/enter/_100", "op": "Enter", "input": ["StatefulPartitionedCall/sequential/lstm_1/PartitionedCall/TensorArrayV2_1"], "attr": {"is_constant": {"b": false}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvc2VxdWVudGlhbC9sc3RtXzEvUGFydGl0aW9uZWRDYWxsL3doaWxl"}, "T": {"type": "DT_VARIANT"}, "parallel_iterations": {"i": "32"}}}, {"name": "StatefulPartitionedCall/sequential/lstm_1/PartitionedCall/while/merge/_116", "op": "Merge", "input": ["StatefulPartitionedCall/sequential/lstm_1/PartitionedCall/while/enter/_105", "StatefulPartitionedCall/sequential/lstm_1/PartitionedCall/while/next_iteration/_152"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/lstm_1/PartitionedCall/while/merge/_117", "op": "Merge", "input": ["StatefulPartitionedCall/sequential/lstm_1/PartitionedCall/while/enter/_106", "StatefulPartitionedCall/sequential/lstm_1/PartitionedCall/while/next_iteration/_153"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/lstm_1/PartitionedCall/while/merge/_118", "op": "Merge", "input": ["StatefulPartitionedCall/sequential/lstm_1/PartitionedCall/while/enter/_107", "StatefulPartitionedCall/sequential/lstm_1/PartitionedCall/while/next_iteration/_154"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/lstm_1/PartitionedCall/while/merge/_110", "op": "Merge", "input": ["StatefulPartitionedCall/sequential/lstm_1/PartitionedCall/while/enter/_99", "StatefulPartitionedCall/sequential/lstm_1/PartitionedCall/while/next_iteration/_146"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/merge/_56", "op": "Merge", "input": ["StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/enter/_45", "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/next_iteration/_92"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/merge/_57", "op": "Merge", "input": ["StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/enter/_46", "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/next_iteration/_93"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/merge/_58", "op": "Merge", "input": ["StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/enter/_47", "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/next_iteration/_94"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/merge/_50", "op": "Merge", "input": ["StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/enter/_39", "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/next_iteration/_86"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/merge/_48", "op": "Merge", "input": ["StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/enter/_37", "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/next_iteration/_84"], "attr": {"N": {"i": "2"}, "_has_manual_control_dependencies": {"b": true}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/lstm_1/PartitionedCall/while/merge/_108", "op": "Merge", "input": ["StatefulPartitionedCall/sequential/lstm_1/PartitionedCall/while/enter/_97", "StatefulPartitionedCall/sequential/lstm_1/PartitionedCall/while/next_iteration/_144"], "attr": {"N": {"i": "2"}, "_has_manual_control_dependencies": {"b": true}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/strided_slice", "op": "StridedSlice", "input": ["StatefulPartitionedCall/sequential/lstm/Shape", "StatefulPartitionedCall/sequential/lstm/strided_slice/stack", "StatefulPartitionedCall/sequential/lstm/strided_slice/stack_1", "StatefulPartitionedCall/sequential/lstm/strided_slice/stack_2"], "attr": {"shrink_axis_mask": {"i": "1"}, "new_axis_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "begin_mask": {"i": "0"}, "end_mask": {"i": "0"}, "T": {"type": "DT_INT32"}, "ellipsis_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/TensorArrayUnstack/TensorListFromTensor", "op": "TensorListFromTensor", "input": ["StatefulPartitionedCall/sequential/lstm/PartitionedCall/transpose", "StatefulPartitionedCall/sequential/lstm/PartitionedCall/TensorArrayUnstack/TensorListFromTensor/element_shape"], "attr": {"shape_type": {"type": "DT_INT32"}, "element_dtype": {"type": "DT_FLOAT"}}, "experimentalType": {"typeId": "TFT_PRODUCT", "args": [{"typeId": "TFT_ARRAY", "args": [{"typeId": "TFT_TENSOR", "args": [{"typeId": "TFT_FLOAT"}]}]}]}}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/Shape", "op": "Shape", "input": ["StatefulPartitionedCall/sequential/lstm/PartitionedCall/transpose"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}, "experimentalType": {"typeId": "TFT_PRODUCT", "args": [{"typeId": "TFT_SHAPE_TENSOR", "args": [{"typeId": "TFT_INT32"}]}]}}, {"name": "StatefulPartitionedCall/sequential/lstm_1/PartitionedCall/while/merge/_111", "op": "Merge", "input": ["StatefulPartitionedCall/sequential/lstm_1/PartitionedCall/while/enter/_100", "StatefulPartitionedCall/sequential/lstm_1/PartitionedCall/while/next_iteration/_147"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_VARIANT"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/zeros_1/packed", "op": "Pack", "input": ["StatefulPartitionedCall/sequential/lstm/strided_slice", "StatefulPartitionedCall/sequential/lstm/zeros_1/packed/1"], "attr": {"N": {"i": "2"}, "axis": {"i": "0"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/zeros/packed", "op": "Pack", "input": ["StatefulPartitionedCall/sequential/lstm/strided_slice", "StatefulPartitionedCall/sequential/lstm/zeros/packed/1"], "attr": {"N": {"i": "2"}, "axis": {"i": "0"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/enter/_44", "op": "Enter", "input": ["StatefulPartitionedCall/sequential/lstm/PartitionedCall/TensorArrayUnstack/TensorListFromTensor"], "attr": {"is_constant": {"b": false}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvc2VxdWVudGlhbC9sc3RtL1BhcnRpdGlvbmVkQ2FsbC93aGlsZQ=="}, "T": {"type": "DT_VARIANT"}, "parallel_iterations": {"i": "32"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/strided_slice", "op": "StridedSlice", "input": ["StatefulPartitionedCall/sequential/lstm/PartitionedCall/Shape", "StatefulPartitionedCall/sequential/lstm/PartitionedCall/strided_slice/stack", "StatefulPartitionedCall/sequential/lstm/PartitionedCall/strided_slice/stack_1", "StatefulPartitionedCall/sequential/lstm/PartitionedCall/strided_slice/stack_2"], "attr": {"shrink_axis_mask": {"i": "1"}, "new_axis_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "begin_mask": {"i": "0"}, "T": {"type": "DT_INT32"}, "end_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/zeros_1", "op": "Fill", "input": ["StatefulPartitionedCall/sequential/lstm/zeros_1/packed", "StatefulPartitionedCall/sequential/lstm/zeros_1/Const"], "attr": {"T": {"type": "DT_FLOAT"}, "index_type": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/zeros", "op": "Fill", "input": ["StatefulPartitionedCall/sequential/lstm/zeros/packed", "StatefulPartitionedCall/sequential/lstm/zeros/Const"], "attr": {"T": {"type": "DT_FLOAT"}, "index_type": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/merge/_55", "op": "Merge", "input": ["StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/enter/_44", "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/next_iteration/_91"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_VARIANT"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/TensorArrayV2_1", "op": "TensorListReserve", "input": ["StatefulPartitionedCall/sequential/lstm/PartitionedCall/TensorArrayV2_1/element_shape", "StatefulPartitionedCall/sequential/lstm/PartitionedCall/strided_slice"], "attr": {"shape_type": {"type": "DT_INT32"}, "element_dtype": {"type": "DT_FLOAT"}}, "experimentalType": {"typeId": "TFT_PRODUCT", "args": [{"typeId": "TFT_ARRAY", "args": [{"typeId": "TFT_TENSOR", "args": [{"typeId": "TFT_FLOAT"}]}]}]}}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/enter/_43", "op": "Enter", "input": ["StatefulPartitionedCall/sequential/lstm/PartitionedCall/strided_slice"], "attr": {"is_constant": {"b": false}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvc2VxdWVudGlhbC9sc3RtL1BhcnRpdGlvbmVkQ2FsbC93aGlsZQ=="}, "T": {"type": "DT_INT32"}, "parallel_iterations": {"i": "32"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/enter/_42", "op": "Enter", "input": ["StatefulPartitionedCall/sequential/lstm/zeros_1"], "attr": {"is_constant": {"b": false}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvc2VxdWVudGlhbC9sc3RtL1BhcnRpdGlvbmVkQ2FsbC93aGlsZQ=="}, "T": {"type": "DT_FLOAT"}, "parallel_iterations": {"i": "32"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/enter/_41", "op": "Enter", "input": ["StatefulPartitionedCall/sequential/lstm/zeros"], "attr": {"is_constant": {"b": false}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvc2VxdWVudGlhbC9sc3RtL1BhcnRpdGlvbmVkQ2FsbC93aGlsZQ=="}, "T": {"type": "DT_FLOAT"}, "parallel_iterations": {"i": "32"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/enter/_40", "op": "Enter", "input": ["StatefulPartitionedCall/sequential/lstm/PartitionedCall/TensorArrayV2_1"], "attr": {"is_constant": {"b": false}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvc2VxdWVudGlhbC9sc3RtL1BhcnRpdGlvbmVkQ2FsbC93aGlsZQ=="}, "T": {"type": "DT_VARIANT"}, "parallel_iterations": {"i": "32"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/merge/_54", "op": "Merge", "input": ["StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/enter/_43", "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/next_iteration/_90"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/merge/_53", "op": "Merge", "input": ["StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/enter/_42", "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/next_iteration/_89"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/merge/_52", "op": "Merge", "input": ["StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/enter/_41", "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/next_iteration/_88"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/merge/_51", "op": "Merge", "input": ["StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/enter/_40", "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/next_iteration/_87"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_VARIANT"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/cond/_35/while/Less", "op": "Less", "input": ["StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/merge/_50", "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/merge/_54", "^StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/merge/_48"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/LoopCond/_59", "op": "LoopCond", "input": ["StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/cond/_35/while/Less"]}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/Func/StatefulPartitionedCall/sequential/lstm/PartitionedCall/input/_15_switch/_65", "op": "Switch", "input": ["StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/merge/_53", "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/LoopCond/_59"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/StatefulPartitionedCall/sequential/lstm/PartitionedCall/TensorArrayUnstack/TensorListFromTensor_switch/_67", "op": "Switch", "input": ["StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/merge/_55", "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/LoopCond/_59"], "attr": {"T": {"type": "DT_VARIANT"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/Func/StatefulPartitionedCall/sequential/lstm/PartitionedCall/input/_16_switch/_68", "op": "Switch", "input": ["StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/merge/_56", "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/LoopCond/_59"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/Func/StatefulPartitionedCall/sequential/lstm/PartitionedCall/input/_14_switch/_64", "op": "Switch", "input": ["StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/merge/_52", "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/LoopCond/_59"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/Func/StatefulPartitionedCall/sequential/lstm/PartitionedCall/input/_17_switch/_69", "op": "Switch", "input": ["StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/merge/_57", "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/LoopCond/_59"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/Func/StatefulPartitionedCall/sequential/lstm/PartitionedCall/input/_18_switch/_70", "op": "Switch", "input": ["StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/merge/_58", "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/LoopCond/_59"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/StatefulPartitionedCall/sequential/lstm/PartitionedCall/time_switch/_62", "op": "Switch", "input": ["StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/merge/_50", "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/LoopCond/_59"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/loop_counter_switch/_60", "op": "Switch", "input": ["StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/merge/_48", "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/LoopCond/_59"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/StatefulPartitionedCall/sequential/lstm/PartitionedCall/TensorArrayV2_1_switch/_63", "op": "Switch", "input": ["StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/merge/_51", "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/LoopCond/_59"], "attr": {"T": {"type": "DT_VARIANT"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/StatefulPartitionedCall/sequential/lstm/PartitionedCall/strided_slice_switch/_66", "op": "Switch", "input": ["StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/merge/_54", "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/LoopCond/_59"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/loop_body_control/_71", "op": "Identity", "input": ["StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/loop_counter_switch/_60:1"], "attr": {"_has_manual_control_dependencies": {"b": true}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/exit/_75", "op": "Exit", "input": ["StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/StatefulPartitionedCall/sequential/lstm/PartitionedCall/TensorArrayV2_1_switch/_63"], "attr": {"T": {"type": "DT_VARIANT"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/body/_36/while/split/split_dim", "op": "Const", "input": ["^StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/loop_body_control/_71"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/next_iteration/_91", "op": "NextIteration", "input": ["StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/StatefulPartitionedCall/sequential/lstm/PartitionedCall/TensorArrayUnstack/TensorListFromTensor_switch/_67:1", "^StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/loop_body_control/_71"], "attr": {"T": {"type": "DT_VARIANT"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/body/_36/while/TensorArrayV2Read/TensorListGetItem/element_shape", "op": "Const", "input": ["^StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/loop_body_control/_71"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/next_iteration/_92", "op": "NextIteration", "input": ["StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/Func/StatefulPartitionedCall/sequential/lstm/PartitionedCall/input/_16_switch/_68:1", "^StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/loop_body_control/_71"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/next_iteration/_93", "op": "NextIteration", "input": ["StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/Func/StatefulPartitionedCall/sequential/lstm/PartitionedCall/input/_17_switch/_69:1", "^StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/loop_body_control/_71"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/body/_36/while/MatMul_1", "op": "MatMul", "input": ["StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/Func/StatefulPartitionedCall/sequential/lstm/PartitionedCall/input/_14_switch/_64:1", "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/Func/StatefulPartitionedCall/sequential/lstm/PartitionedCall/input/_17_switch/_69:1", "^StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/loop_body_control/_71"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "grad_a": {"b": false}, "T": {"type": "DT_FLOAT"}, "grad_b": {"b": false}, "transpose_b": {"b": false}}}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/next_iteration/_94", "op": "NextIteration", "input": ["StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/Func/StatefulPartitionedCall/sequential/lstm/PartitionedCall/input/_18_switch/_70:1", "^StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/loop_body_control/_71"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Func/StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/body/_36/input/_171", "op": "Identity", "input": ["StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/StatefulPartitionedCall/sequential/lstm/PartitionedCall/time_switch/_62:1", "^StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/loop_body_control/_71"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/body/_36/while/add_2/y", "op": "Const", "input": ["^StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/loop_body_control/_71"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/body/_36/while/add_3/y", "op": "Const", "input": ["^StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/loop_body_control/_71"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/next_iteration/_90", "op": "NextIteration", "input": ["StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/StatefulPartitionedCall/sequential/lstm/PartitionedCall/strided_slice_switch/_66:1", "^StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/loop_body_control/_71"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/TensorArrayV2Stack/TensorListStack", "op": "TensorListStack", "input": ["StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/exit/_75", "StatefulPartitionedCall/sequential/lstm/PartitionedCall/TensorArrayV2Stack/TensorListStack/element_shape"], "attr": {"num_elements": {"i": "-1"}, "element_dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/body/_36/while/TensorArrayV2Read/TensorListGetItem", "op": "TensorListGetItem", "input": ["StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/StatefulPartitionedCall/sequential/lstm/PartitionedCall/TensorArrayUnstack/TensorListFromTensor_switch/_67:1", "Func/StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/body/_36/input/_171", "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/body/_36/while/TensorArrayV2Read/TensorListGetItem/element_shape"], "attr": {"element_dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/body/_36/while/add_2", "op": "AddV2", "input": ["Func/StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/body/_36/input/_171", "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/body/_36/while/add_2/y"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/body/_36/while/add_3", "op": "AddV2", "input": ["StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/loop_counter_switch/_60:1", "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/body/_36/while/add_3/y"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/lstm_1/PartitionedCall/TensorArrayUnstack/TensorListFromTensor", "op": "TensorListFromTensor", "input": ["StatefulPartitionedCall/sequential/lstm/PartitionedCall/TensorArrayV2Stack/TensorListStack", "StatefulPartitionedCall/sequential/lstm_1/PartitionedCall/TensorArrayUnstack/TensorListFromTensor/element_shape"], "attr": {"shape_type": {"type": "DT_INT32"}, "element_dtype": {"type": "DT_FLOAT"}}, "experimentalType": {"typeId": "TFT_PRODUCT", "args": [{"typeId": "TFT_ARRAY", "args": [{"typeId": "TFT_TENSOR", "args": [{"typeId": "TFT_FLOAT"}]}]}]}}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/transpose_1", "op": "Transpose", "input": ["StatefulPartitionedCall/sequential/lstm/PartitionedCall/TensorArrayV2Stack/TensorListStack", "StatefulPartitionedCall/sequential/lstm/PartitionedCall/transpose_1/perm"], "attr": {"Tperm": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/lstm_1/PartitionedCall/Shape", "op": "Shape", "input": ["StatefulPartitionedCall/sequential/lstm/PartitionedCall/TensorArrayV2Stack/TensorListStack"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}, "experimentalType": {"typeId": "TFT_PRODUCT", "args": [{"typeId": "TFT_SHAPE_TENSOR", "args": [{"typeId": "TFT_INT32"}]}]}}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/body/_36/while/add", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/body/_36/while/TensorArrayV2Read/TensorListGetItem", "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/Func/StatefulPartitionedCall/sequential/lstm/PartitionedCall/input/_16_switch/_68:1", "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/body/_36/while/MatMul_1"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "transpose_b": {"b": false}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "num_args": {"i": "1"}, "leakyrelu_alpha": {"f": 0.2}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/next_iteration/_86", "op": "NextIteration", "input": ["StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/body/_36/while/add_2", "^StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/loop_body_control/_71"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/next_iteration/_84", "op": "NextIteration", "input": ["StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/body/_36/while/add_3", "^StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/loop_body_control/_71"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/lstm_1/PartitionedCall/while/enter/_104", "op": "Enter", "input": ["StatefulPartitionedCall/sequential/lstm_1/PartitionedCall/TensorArrayUnstack/TensorListFromTensor"], "attr": {"is_constant": {"b": false}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvc2VxdWVudGlhbC9sc3RtXzEvUGFydGl0aW9uZWRDYWxsL3doaWxl"}, "T": {"type": "DT_VARIANT"}, "parallel_iterations": {"i": "32"}}}, {"name": "StatefulPartitionedCall/sequential/lstm_1/Shape", "op": "Shape", "input": ["StatefulPartitionedCall/sequential/lstm/PartitionedCall/transpose_1"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}, "experimentalType": {"typeId": "TFT_PRODUCT", "args": [{"typeId": "TFT_SHAPE_TENSOR", "args": [{"typeId": "TFT_INT32"}]}]}}, {"name": "StatefulPartitionedCall/sequential/lstm_1/PartitionedCall/strided_slice", "op": "StridedSlice", "input": ["StatefulPartitionedCall/sequential/lstm_1/PartitionedCall/Shape", "StatefulPartitionedCall/sequential/lstm_1/PartitionedCall/strided_slice/stack", "StatefulPartitionedCall/sequential/lstm_1/PartitionedCall/strided_slice/stack_1", "StatefulPartitionedCall/sequential/lstm_1/PartitionedCall/strided_slice/stack_2"], "attr": {"shrink_axis_mask": {"i": "1"}, "new_axis_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "begin_mask": {"i": "0"}, "T": {"type": "DT_INT32"}, "end_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/body/_36/while/BiasAdd", "op": "BiasAdd", "input": ["StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/body/_36/while/add", "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/Func/StatefulPartitionedCall/sequential/lstm/PartitionedCall/input/_18_switch/_70:1"], "attr": {"data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/lstm_1/PartitionedCall/while/merge/_115", "op": "Merge", "input": ["StatefulPartitionedCall/sequential/lstm_1/PartitionedCall/while/enter/_104", "StatefulPartitionedCall/sequential/lstm_1/PartitionedCall/while/next_iteration/_151"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_VARIANT"}}}, {"name": "StatefulPartitionedCall/sequential/lstm_1/strided_slice", "op": "StridedSlice", "input": ["StatefulPartitionedCall/sequential/lstm_1/Shape", "StatefulPartitionedCall/sequential/lstm_1/strided_slice/stack", "StatefulPartitionedCall/sequential/lstm_1/strided_slice/stack_1", "StatefulPartitionedCall/sequential/lstm_1/strided_slice/stack_2"], "attr": {"shrink_axis_mask": {"i": "1"}, "new_axis_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "begin_mask": {"i": "0"}, "T": {"type": "DT_INT32"}, "end_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/sequential/lstm_1/PartitionedCall/while/enter/_103", "op": "Enter", "input": ["StatefulPartitionedCall/sequential/lstm_1/PartitionedCall/strided_slice"], "attr": {"is_constant": {"b": false}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvc2VxdWVudGlhbC9sc3RtXzEvUGFydGl0aW9uZWRDYWxsL3doaWxl"}, "T": {"type": "DT_INT32"}, "parallel_iterations": {"i": "32"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/body/_36/while/split", "op": "Split", "input": ["StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/body/_36/while/split/split_dim", "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/body/_36/while/BiasAdd"], "attr": {"num_split": {"i": "4"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/lstm_1/zeros_1/packed", "op": "Pack", "input": ["StatefulPartitionedCall/sequential/lstm_1/strided_slice", "StatefulPartitionedCall/sequential/lstm_1/zeros_1/packed/1"], "attr": {"N": {"i": "2"}, "axis": {"i": "0"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/lstm_1/zeros/packed", "op": "Pack", "input": ["StatefulPartitionedCall/sequential/lstm_1/strided_slice", "StatefulPartitionedCall/sequential/lstm_1/zeros/packed/1"], "attr": {"N": {"i": "2"}, "axis": {"i": "0"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/lstm_1/PartitionedCall/while/merge/_114", "op": "Merge", "input": ["StatefulPartitionedCall/sequential/lstm_1/PartitionedCall/while/enter/_103", "StatefulPartitionedCall/sequential/lstm_1/PartitionedCall/while/next_iteration/_150"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/body/_36/while/Sigmoid", "op": "Sigmoid", "input": ["StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/body/_36/while/split"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/body/_36/while/Sigmoid_1", "op": "Sigmoid", "input": ["StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/body/_36/while/split:1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/body/_36/while/Tanh", "op": "Tanh", "input": ["StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/body/_36/while/split:2"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/body/_36/while/Sigmoid_2", "op": "Sigmoid", "input": ["StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/body/_36/while/split:3"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/lstm_1/zeros_1", "op": "Fill", "input": ["StatefulPartitionedCall/sequential/lstm_1/zeros_1/packed", "StatefulPartitionedCall/sequential/lstm_1/zeros_1/Const"], "attr": {"T": {"type": "DT_FLOAT"}, "index_type": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/lstm_1/zeros", "op": "Fill", "input": ["StatefulPartitionedCall/sequential/lstm_1/zeros/packed", "StatefulPartitionedCall/sequential/lstm_1/zeros/Const"], "attr": {"T": {"type": "DT_FLOAT"}, "index_type": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/lstm_1/PartitionedCall/while/cond/_95/while/Less", "op": "Less", "input": ["StatefulPartitionedCall/sequential/lstm_1/PartitionedCall/while/merge/_110", "StatefulPartitionedCall/sequential/lstm_1/PartitionedCall/while/merge/_114", "^StatefulPartitionedCall/sequential/lstm_1/PartitionedCall/while/merge/_108"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/body/_36/while/mul", "op": "Mul", "input": ["StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/body/_36/while/Sigmoid_1", "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/Func/StatefulPartitionedCall/sequential/lstm/PartitionedCall/input/_15_switch/_65:1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/body/_36/while/mul_1", "op": "Mul", "input": ["StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/body/_36/while/Sigmoid", "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/body/_36/while/Tanh"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/lstm_1/PartitionedCall/while/enter/_102", "op": "Enter", "input": ["StatefulPartitionedCall/sequential/lstm_1/zeros_1"], "attr": {"is_constant": {"b": false}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvc2VxdWVudGlhbC9sc3RtXzEvUGFydGl0aW9uZWRDYWxsL3doaWxl"}, "T": {"type": "DT_FLOAT"}, "parallel_iterations": {"i": "32"}}}, {"name": "StatefulPartitionedCall/sequential/lstm_1/PartitionedCall/while/enter/_101", "op": "Enter", "input": ["StatefulPartitionedCall/sequential/lstm_1/zeros"], "attr": {"is_constant": {"b": false}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvc2VxdWVudGlhbC9sc3RtXzEvUGFydGl0aW9uZWRDYWxsL3doaWxl"}, "T": {"type": "DT_FLOAT"}, "parallel_iterations": {"i": "32"}}}, {"name": "StatefulPartitionedCall/sequential/lstm_1/PartitionedCall/while/LoopCond/_119", "op": "LoopCond", "input": ["StatefulPartitionedCall/sequential/lstm_1/PartitionedCall/while/cond/_95/while/Less"]}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/body/_36/while/add_1", "op": "AddV2", "input": ["StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/body/_36/while/mul", "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/body/_36/while/mul_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/lstm_1/PartitionedCall/while/merge/_113", "op": "Merge", "input": ["StatefulPartitionedCall/sequential/lstm_1/PartitionedCall/while/enter/_102", "StatefulPartitionedCall/sequential/lstm_1/PartitionedCall/while/next_iteration/_149"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/lstm_1/PartitionedCall/while/merge/_112", 